build/docs/prob-B.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Problem Set <code>B</code></title>
<!-- 2017-04-27 Thu 09:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="./style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="./style/css/override.css" />
<link rel="icon" type="image/png" href="./style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Problem Set <code>B</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Group B Problem set</a>
<ul>
<li><a href="#sec-1-1">1.1. Guard</a></li>
<li><a href="#sec-1-2">1.2. Engine</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Group B Problem set</h2>
<div class="outline-text-2" id="text-1">
<p>
You are given the implementation of the <code>show_users</code> route.
Please study the implementation and the test cases to
understand how the route is implemented across the two
components: guard and engine.
</p>

<p>
Now, your job is to complete the implementation of the guard
and engine components for <code>del-user</code> user route.  
</p>

<p>
Follow these steps:
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Guard</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Go to the <a href="./runtime/components/guard/del_user/index.html">del_user</a> directory that contains a command
handler <code>DelUser.do</code>.  
</li>

<li>Go to the <code>Checks</code> section of the  <a href="./runtime/components/guard/del_user/index.html">del_user</a> page of <code>Guard</code>.
Under each of its subsections, you will find
incomplete definitions of methods, namely:

<ul class="org-ul">
<li><code>check_type</code>
</li>
<li><code>check_auth</code>
</li>
<li><code>check_state</code>
</li>

<li>Complete the definitions of the above methods.
</li>
</ul>
</li>
</ol>


<ol class="org-ol">
<li>Build and test.  There are some test cases in the
</li>
</ol>
<p>
<a href="./runtime/components/guard/del_user/tests">del_user tests</a>.  Please study them and make sure
that they continue to PASS!
</p>

<ol class="org-ol">
<li>Write the test case <code>test_check_auth</code>.  Complete the
</li>
</ol>
<p>
<a href="./runtime/components/guard/del_user/tests/del-user-without-admin-role.html">TestCheckAuth</a> test case by providing a definition of
the <code>test_check_auth</code> method.  This test is supposed
to raise an exception because the session's role is
not admin.
</p>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Engine</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Go to the <a href="./runtime/components/engine/del_user/index.html">del_user</a> directory of the engine that
contains a skeleton of the command handler <code>DelUser.do</code>.
</li>
</ol>


<ol class="org-ol">
<li>Complete the <code>do</code> method by invoking the appropriate
</li>
</ol>
<p>
method on the entity manager.
</p>


<ol class="org-ol">
<li>Make sure test cases continue to PASS!
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-27 Thu]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 09:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
